package Ch17Interface;

public class 정리{}

//------------------절차------------------
//***Data - 저장?
//- 자료형(일반/클래스)
//- 변수/상수(심볼릭, 리터럴) 
//
//- 메모리 영역 : Stack({}에 있는 것)/Heap(객체)/Class(공유)
//
//***Date - 처리?
//연산자 기호
//- 산술/대입/복합/비교/논리/증감/삼항
//제어흐름문
//- if/switch/while/for



//------------------객체------------------
//
//Basic 객체 일반
//객체 무엇인가?
//- 객체의 구조
// 속성(멤버 변수, 필드)
// 기능 (멤버 메서드)
// 생성자
// 
//-클래스
//
//-오버로딩
//-정보은닉(private, getter and setter)
//-배열 : 일반 자료형 배열, 클래스 자료형 배열
//-this
//-기본코드
//Scanner sc = new Scanner(System.in);
//
//static,Singleton 패턴
//
//- 상속
// 상속 기본코드
// 오버라이딩
// Up/downcasting
// 추상 클래스
// 인터페이스